#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```hcl
terraform
tls_private_key.hashicat: Refreshing state... [id=abeafde5125bb35b09626926990b8fd763542022]
data.aws_ami.ubuntu: Reading...
aws_key_pair.hashicat: Refreshing state... [id=dev-ssh-key.pem]
aws_vpc.hashicat: Refreshing state... [id=vpc-026ae6b28801867b5]
aws_internet_gateway.hashicat: Refreshing state... [id=igw-0c63cc3ddf0c049f4]
aws_subnet.hashicat: Refreshing state... [id=subnet-0b7d1dd7e1fed1dd1]
aws_security_group.hashicat: Refreshing state... [id=sg-06c447fe3c36dd562]
data.aws_ami.ubuntu: Read complete after 0s [id=ami-0443a434a57db296a]
aws_route_table.hashicat: Refreshing state... [id=rtb-0c0214e8215115100]
aws_instance.hashicat: Refreshing state... [id=i-09f91e1712bdaa7e6]
aws_route_table_association.hashicat: Refreshing state... [id=rtbassoc-027f0669dc4177304]
aws_eip.hashicat: Refreshing state... [id=eipalloc-05ec2abacb8901ae7]
aws_eip_association.hashicat: Refreshing state... [id=eipassoc-0c6e075d12d63ce9f]
null_resource.configure-cat-app: Refreshing state... [id=6445266301745514001]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_eip.hashicat has been deleted
  - resource "aws_eip" "hashicat" {
      - id                       = "eipalloc-05ec2abacb8901ae7" -> null
      - public_dns               = "ec2-3-34-149-221.ap-northeast-2.compute.amazonaws.com" -> null
      - public_ip                = "3.34.149.221" -> null
        # (16 unchanged attributes hidden)
    }

  # aws_instance.hashicat has been deleted
  - resource "aws_instance" "hashicat" {
      - id                                   = "i-09f91e1712bdaa7e6" -> null
        tags                                 = {
            "Name" = "dev-hashicat-instance"
        }
        # (39 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # aws_internet_gateway.hashicat has been deleted
  - resource "aws_internet_gateway" "hashicat" {
      - id       = "igw-0c63cc3ddf0c049f4" -> null
        tags     = {
            "Name" = "dev-internet-gateway"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_key_pair.hashicat has been deleted
  - resource "aws_key_pair" "hashicat" {
        id              = "dev-ssh-key.pem"
      - key_name        = "dev-ssh-key.pem" -> null
        # (7 unchanged attributes hidden)
    }

  # aws_route_table.hashicat has been deleted
  - resource "aws_route_table" "hashicat" {
      - id               = "rtb-0c0214e8215115100" -> null
        # (6 unchanged attributes hidden)
    }

  # aws_security_group.hashicat has been deleted
  - resource "aws_security_group" "hashicat" {
      - id                     = "sg-06c447fe3c36dd562" -> null
        name                   = "dev-security-group"
        tags                   = {
            "Name" = "dev-security-group"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_subnet.hashicat has been deleted
  - resource "aws_subnet" "hashicat" {
      - id                                             = "subnet-0b7d1dd7e1fed1dd1" -> null
        tags                                           = {
            "name" = "dev-subnet"
        }
        # (20 unchanged attributes hidden)
    }

  # aws_vpc.hashicat has been deleted
  - resource "aws_vpc" "hashicat" {
      - id                                   = "vpc-026ae6b28801867b5" -> null
        tags                                 = {
            "environment" = "dev"
            "name"        = "dev-vpc-ap-northeast-2"
        }
        # (19 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.hashicat will be created
  + resource "aws_eip" "hashicat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags_all             = {
          + "environment" = "MY-ENV"
          + "name"        = "DEV-vpc-ap-northeast-2"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip_association.hashicat will be created
  + resource "aws_eip_association" "hashicat" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # aws_instance.hashicat will be created
  + resource "aws_instance" "hashicat" {
      + ami                                  = "ami-0443a434a57db296a"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "DEV-ssh-key.pem"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "DEV-hashicat-instance"
        }
      + tags_all                             = {
          + "Name"        = "DEV-hashicat-instance"
          + "environment" = "MY-ENV"
          + "name"        = "DEV-vpc-ap-northeast-2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # aws_internet_gateway.hashicat will be created
  + resource "aws_internet_gateway" "hashicat" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "DEV-internet-gateway"
        }
      + tags_all = {
          + "Name"        = "DEV-internet-gateway"
          + "environment" = "MY-ENV"
          + "name"        = "DEV-vpc-ap-northeast-2"
        }
      + vpc_id   = (known after apply)
    }

  # aws_key_pair.hashicat will be created
  + resource "aws_key_pair" "hashicat" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "DEV-ssh-key.pem"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCj0VBP2SG0d7MtqtatLTZL5CL+h13X/omlV7yJB/0Al1k6ObEKeLNzeA07KaVCxqpGzULIk2ebzc0IxyBE/MjI1j+w0ujMNJLSQJIaW5jwNyx+PayEgSi6cd+XwdGgxjoxZxrfpPHgP5I8s3n5Bx4zvK8PshcLoXEPR+gpL31BsWvQ0BmOLlZwtTL4vEw9PKPhYX9pT6VhmrgLmVyqIM7kwSUx+OsQfnVDH7IVc6DwBHs3AU8GvyIo7RnTbN27BPnh1U1E6sjkHvSUALCJoH0Zq1fJ6uT0VUtL/Rmo6U9uGKNlioMpeyCFOP+NtIgaVq6b5TX5CmHr+lGx44ndoaYb"
      + tags_all        = {
          + "environment" = "MY-ENV"
          + "name"        = "DEV-vpc-ap-northeast-2"
        }
    }

  # aws_route_table.hashicat will be created
  + resource "aws_route_table" "hashicat" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags_all         = {
          + "environment" = "MY-ENV"
          + "name"        = "DEV-vpc-ap-northeast-2"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.hashicat will be created
  + resource "aws_route_table_association" "hashicat" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.hashicat will be created
  + resource "aws_security_group" "hashicat" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
                # (1 unchanged attribute hidden)
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "DEV-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "DEV-security-group"
        }
      + tags_all               = {
          + "Name"        = "DEV-security-group"
          + "environment" = "MY-ENV"
          + "name"        = "DEV-vpc-ap-northeast-2"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.hashicat will be created
  + resource "aws_subnet" "hashicat" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = (known after apply)
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "name" = "DEV-subnet"
        }
      + tags_all                                       = {
          + "environment" = "MY-ENV"
          + "name"        = "DEV-subnet"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.hashicat will be created
  + resource "aws_vpc" "hashicat" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "environment" = "dev"
          + "name"        = "DEV-vpc-ap-northeast-2"
        }
      + tags_all                             = {
          + "environment" = "dev"
          + "name"        = "DEV-vpc-ap-northeast-2"
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ catapp_ip  = "http://3.34.149.221" -> (known after apply)
  ~ catapp_url = "http://ec2-3-34-149-221.ap-northeast-2.compute.amazonaws.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
**Pusher**: @hyejeong-jin
**Action**: pull_request
